{
    "code": "ENGL 350",
    "name": "Writing about Literature, Text, and Culture",
    "credit_hour": "Credit:3 hours.",
    "criterias": [
        "Advanced Composition"
    ],
    "sections": [
        {
            "status": "<span class=\"hide\">2</span><span class=\"sr-only\">section restricted</span><img src=\"/static/images/sectionRestricted.png\" title=\"Open (Restricted)\" alt=\"Open (Restricted)\"/>",
            "favorite": "<a href=\"/login/refresh?r=/schedule/2024/spring/ENGL/350\" data-toggle=\"popover\" data-trigger=\"hover\" data-content=\"Add this Section to a personalized favorites list.  Must be logged in.\"><span class=\"glyphicon glyphicon-star-empty app-font16 aria-label=Activate to add to favorites. \"></span> </a>",
            "crn": "70306",
            "type": "<div class=\"app-meeting\">Online</div>",
            "section": "<div class=\"app-meeting\">B  </div>",
            "time": "<span class=\"hide\">0930</span><div class=\"app-meeting\">09:30AM - 10:45AM</div>",
            "day": "<div class=\"app-meeting\">TR     </div>",
            "location": "<div class=\"app-meeting\">n.a.</div>",
            "instructor": "<div class=\"app-meeting\">Nazar, H<br /></div>",
            "availability": "Open (Restricted)",
            "credit": "3 hours",
            "sectionTitle": "Writing About Lit Text Culture",
            "sectionDescription": null,
            "courseDescription": null,
            "sectionDegreeNotes": null,
            "courseDegreeNotes": "Advanced Composition course.",
            "specialApproval": "",
            "approvalCode": null,
            "sectionFee": "",
            "sectionDateRange": "Meets 01/16/24-05/01/24",
            "partOfTerm": "1",
            "info": "SP 24 - ENGL 350 - Writing About Literature, Text, and Culture - Hina Nazar - Women’s Friendship and Community in British Literature, Margaret Cavendish to Jane Austen - In A Serious Proposal to the Ladies (1694), the early feminist philosopher Mary Astell argued that women should fight centuries of gender oppression by retreating from the world of men, at least temporarily, to “Protestant nunneries.” There they could escape the roles and trivial pursuits prescribed by patriarchal society, substituting French philosophy and the Bible for the dubious pleasures of their looking-glasses and unreliable male flattery.  Don’t look to men for your self-worth, Astell repeatedly urged her female readers.  Look instead to yourselves and to admirable women friends, who will help you perfect both faith and judgment, and enable you to create a new Garden of Eden, where there are no men or “serpents to deceive you.”  Astell’s striking comments about female solidarity find parallels throughout the long eighteenth century: in plays by women such as Margaret Cavendish’s The Convent of Pleasure (1668), where “Lady Happy” establishes a secular convent that doesn’t require taking religious vows, only a vow to enjoy oneself; in the friendship poetry of Katherine Philips (“Orinda”) and Anne Finch; in utopian novels such as Sarah Scott’s Millenium Hall (1762), which fictionalizes Astell’s retreat in important ways; and in novels about female education and marriage, including Sarah Fielding’s The Governess (1749), Mary Wollstonecraft’s Wrongs of Woman or Maria (1798), and Jane Austen’s Emma (1816).  This seminar explores how a feminist consciousness came into being in Britain during the period known as the Enlightenment (roughly, 1650-1800), and how women writers, from Cavendish to Austen, represented women’s agency, friendship between women, and the potential of separatist female communities. English 350 seeks at once to introduce you to some very intriguing writing by women from the past and to bring into focus the writing process that is such an integral part of your own lives as undergraduates.  Through workshops, revisions, and peer review, the course aims to help you build the skills required for doing research in English, including developing strong argumentative theses and paper topics, constructing a cogent bibliography, and situating your work in a wider scholarly conversation.",
            "corequest": null,
            "restricted": "Restricted to English or Creative Writing or Creative Writing major(s) or minor(s). Restricted to Undergrad - Urbana-Champaign.<br/>"
        },
        {
            "status": "<span class=\"hide\">2</span><span class=\"sr-only\">section restricted</span><img src=\"/static/images/sectionRestricted.png\" title=\"Open (Restricted)\" alt=\"Open (Restricted)\"/>",
            "favorite": "<a href=\"/login/refresh?r=/schedule/2024/spring/ENGL/350\" data-toggle=\"popover\" data-trigger=\"hover\" data-content=\"Add this Section to a personalized favorites list.  Must be logged in.\"><span class=\"glyphicon glyphicon-star-empty app-font16 aria-label=Activate to add to favorites. \"></span> </a>",
            "crn": "70307",
            "type": "<div class=\"app-meeting\">Lecture-Discussion</div>",
            "section": "<div class=\"app-meeting\">F  </div>",
            "time": "<span class=\"hide\">1500</span><div class=\"app-meeting\">03:00PM - 03:50PM</div>",
            "day": "<div class=\"app-meeting\">MWF    </div>",
            "location": "<div class=\"app-meeting\">131 English Building</div>",
            "instructor": "<div class=\"app-meeting\">McNulty, T<br /></div>",
            "availability": "Open (Restricted)",
            "credit": "3 hours",
            "sectionTitle": "Writing About Lit Text Culture",
            "sectionDescription": null,
            "courseDescription": null,
            "sectionDegreeNotes": null,
            "courseDegreeNotes": "Advanced Composition course.",
            "specialApproval": "",
            "approvalCode": null,
            "sectionFee": "",
            "sectionDateRange": "Meets 01/16/24-05/01/24",
            "partOfTerm": "1",
            "info": "SP24 - ENGL 350 - Writing About Literature, Text, and Culture - Tess McNulty - Fiction and Therapy - We are living in the era of therapy. Since the late 1800s and early 1900s, when Freud and others began to theorize the “talking cure,” to the present day, when every blogger and TikTok-er offers advice on how to “do the work,” psychotherapy, and the ideas that surround it, have inundated our culture and our lives. Meanwhile, multiple works of literature and art—from novels by Virginia Woolf and Philip Roth, to poems and comics by Claudia Rankine and Alison Bechdel, to TV shows and podcasts like the Sopranos and “How Should We Begin?”—have responded to, and depicted, therapeutic ideas and practices. In this course, we’ll survey the post-1900 history of therapeutic thought and practice through the lens of this body of fictional work, exploring not only how fiction has engaged with all things therapeutic, but also how fiction is—or has aspired to be—its own type of therapy. This writing-centric course will also focus, particularly, on helping students hone the skill of writing literary and art-critical essays. Through hands on lessons, we’ll walk through every step of the process, from close reading, researching, and outlining, to crafting and structuring compelling arguments.",
            "corequest": null,
            "restricted": "Restricted to English or Creative Writing or Creative Writing major(s) or minor(s). Restricted to Undergrad - Urbana-Champaign.<br/>"
        },
        {
            "status": "<span class=\"hide\">2</span><span class=\"sr-only\">section restricted</span><img src=\"/static/images/sectionRestricted.png\" title=\"Open (Restricted)\" alt=\"Open (Restricted)\"/>",
            "favorite": "<a href=\"/login/refresh?r=/schedule/2024/spring/ENGL/350\" data-toggle=\"popover\" data-trigger=\"hover\" data-content=\"Add this Section to a personalized favorites list.  Must be logged in.\"><span class=\"glyphicon glyphicon-star-empty app-font16 aria-label=Activate to add to favorites. \"></span> </a>",
            "crn": "70308",
            "type": "<div class=\"app-meeting\">Lecture-Discussion</div>",
            "section": "<div class=\"app-meeting\">S  </div>",
            "time": "<span class=\"hide\">1400</span><div class=\"app-meeting\">02:00PM - 03:15PM</div>",
            "day": "<div class=\"app-meeting\">TR     </div>",
            "location": "<div class=\"app-meeting\">108 English Building</div>",
            "instructor": "<div class=\"app-meeting\">Gilmore, S<br /></div>",
            "availability": "Open (Restricted)",
            "credit": "3 hours",
            "sectionTitle": "Writing About Lit Text Culture",
            "sectionDescription": null,
            "courseDescription": null,
            "sectionDegreeNotes": null,
            "courseDegreeNotes": "Advanced Composition course.",
            "specialApproval": "",
            "approvalCode": null,
            "sectionFee": "",
            "sectionDateRange": "Meets 01/16/24-05/01/24",
            "partOfTerm": "1",
            "info": "SP24 - ENGL 350 - Writing about Literature, Text, and Culture - Shawn Gilmore - Comics: History, Politics, Conspiracy - Comics and graphic narratives, with their specific visual and textual elements, can stand in unique relations to the histories and political perspectives they treat. Certain genres, including superhero, horror, and historical narratives, further complicate these intersections. In this course, we will take up a range of comics and graphic novels that engage with history and politics, with works that might include Alan Moore and Eddie Campbell’s From Hell, Derk Backderf’s Kent State, Jon Lewis, Andrew Aydin, and Nate Powell’s March, and Kyle Baker’s Nat Turner, and read comics starring characters like Black Panther, Captain America, and Superman. Part of the class will focus on the rise of a particular strain of conspiracy comics, including Big Numbers, Right State, American Carnage, and Department of Truth, which engage with the historical and political via contemporary notions of conspiracy. Complementing these works, we will read broadly from recent arguments in comics studies. As a writing-focused class, we will also focus on the mechanics of long-form writing and how to best develop and deploy arguments in and around comics.",
            "corequest": null,
            "restricted": "Restricted to English or Creative Writing or Creative Writing major(s) or minor(s). Restricted to Undergrad - Urbana-Champaign.<br/>"
        }
    ]
}